//
//  ProductDetailView.swift
//  KyarLay
//
//  Created by Mg Chan on 5/28/24.
//

import Foundation
import SwiftUI

struct ProductDetailView: View {
    var body: some View {
        VStack(alignment: .leading){
            Text("PRODUCT DETAILS")
                .font(.system(size: 20))
                .fontWeight(.bold)
                .foregroundColor(.black)
                .padding([.leading,.bottom])
            ExpandableText(text: "အလေးချိန်-၈၅၀ဂရမ်ပါဝင်သောပစ္စည်းများ - Lutein၊ သဘာဝဗီတာမင် E၊ DHA၊ HMOသုံးစွဲရန်အညွှန်း - ကိုယ်ခံစွမ်းအားကောင်းမွန်စေခြင်း၊ ဦးနှောက်နှင့် အမြင်အာရုံဖွံ့ဖြိုးတိုးတက်စေခြင်းအတွက်။သုံးစွဲရန်ပမာဏ - တစ်နေ့လျှင် (၂)ခွက် သောက်သုံးနိုင်ပါသည်။ဘေးထွက်ဆိုးကျိုး - ဖြည့်စွက်စာဖြစ်သည့်အတွက်ဘေးထွက်ဆိုးကျိုးနည်းပါသည်။အသက်အရွယ် - ၂နှစ်အထက်ထုတ်လုပ်သည့်နိုင်ငံ - အမေရိကန်အလေးချိန်-၈၅၀ဂရမ်ပါဝင်သောပစ္စည်းများ - Lutein၊ သဘာဝဗီတာမင် E၊ DHA၊ HMOသုံးစွဲရန်အညွှန်း - ကိုယ်ခံစွမ်းအားကောင်းမွန်စေခြင်း၊ ဦးနှောက်နှင့် အမြင်အာရုံဖွံ့ဖြိုးတိုးတက်စေခြင်းအတွက်။သုံးစွဲရန်ပမာဏ - တစ်နေ့လျှင် (၂)ခွက် သောက်သုံးနိုင်ပါသည်။ဘေးထွက်ဆိုးကျိုး - ဖြည့်စွက်စာဖြစ်သည့်အတွက်ဘေးထွက်ဆိုးကျိုးနည်းပါသည်။အသက်အရွယ် - ၂နှစ်အထက်ထုတ်လုပ်သည့်နိုင်ငံ - အမေရိကန်")
        }
    }
}

